JacobBachle/MSP432/lab10/lab10.c
//******************************************************************************
// Main Comment Header:
// Jacob Bachle and Rafael Cano
// Current Semester: Spring 2026
// Lab Section: 1
// Date Created: 3/10/26
// Description:
// Bumper switches control left and right wheel motion using PWM.
// LEDs display status per certification sheet.
//******************************************************************************

// DriverLib Includes
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>

// Standard Includes
#include <stdint.h>
#include <stdbool.h>

//#include <stdio.h>

// Function Prototypes
void toggleAllLEDSONTest(void);
void toggleAllLEDSOFFTest(void);

void toggleRSLKLEDTest(void);

void bumperSwitchesHandler(void);

void configure432IO(void);
void configureRobotIO(void);
//void readBumperSwitches(void);
void serviceLeftMotorLED(void);
void serviceRightMotorLED(void);
void serviceLeftMotor(void);
void serviceRightMotor(void);
void configPWMTimer(uint16_t clockPeriod, uint16_t clockDivider, uint16_t duty, uint16_t channel);

// Functions added in lab 7
void LEDStatesControl(void);
void serviceLEDs(void);
void readLineSensors(void);
void processSensorData(void);

// Functions added in lab 8
void handleStandBy(void);
void updateMotorDuty(void);
void updateMotorDutyL(void);
void updateMotorDutyR(void);
void updateDutyState(void);
void turnOnWhiteLED2(void);
void turnOffWhiteLED2(void);

// Global Defines
#define PERIOD 40
//#define DUTY 50
#define slowDuty 15
#define medDuty 30
#define fastDuty 70
#define CLOCKDIVIDER TIMER_A_CLOCKSOURCE_DIVIDER_48
#define LEFTCHANNEL  TIMER_A_CAPTURECOMPARE_REGISTER_4
#define RIGHTCHANNEL TIMER_A_CAPTURECOMPARE_REGISTER_3

// Typedefs to store states
typedef enum {motorOFF,motorForward,motorReverse,motorTest} motorStates;
typedef enum {bumperON, bumperOFF} bumperStates;
typedef enum {RED, YELLOW, GREEN, CYAN, BLUE, WHITE} LED2state;
typedef enum {on, off} LED1state;
typedef enum {PowerUp, StandBy, Tracking, Lost} mode;

// Typedefs added in lab 8
//typedef enum {slow, med, fast} speed;
typedef enum {hardLeft, left, stright, right, hardRight, lost} correctionNeeded;

//Current states
motorStates leftMotorState = motorOFF;
motorStates rightMotorState = motorOFF;
bumperStates BMP0 = bumperOFF;
bumperStates BMPn = bumperOFF;
LED1state LED1State = off;
LED2state LED2State;

mode currentMode = StandBy;
uint8_t currentSpeedL = medDuty;
uint8_t currentSpeedR = medDuty;
correctionNeeded currentCorrectionNeeded = lost;

Timer_A_PWMConfig timerPWMConfig;

// Timer Base
const uint32_t TIMER = TIMER_A0_BASE;

// Global vars
volatile uint8_t sensorValues = 0;
volatile uint8_t leftCount = 0;
volatile uint8_t rightCount = 0;
volatile uint8_t totalCount = 0;

//Added in lab 10
const int16_t IR0Weight = -10;
const int16_t IR1Weight = -6;
const int16_t IR2Weight = -3;
const int16_t IR3Weight = 0;
const int16_t IR4Weight = 0;
const int16_t IR5Weight = 3;
const int16_t IR6Weight = 6;
const int16_t IR7Weight = 10;

uint16_t timeNotGreen = 0;

volatile uint8_t sensorValue0 = 0;
volatile uint8_t sensorValue1 = 0;
volatile uint8_t sensorValue2 = 0;
volatile uint8_t sensorValue3 = 0;
volatile uint8_t sensorValue4 = 0;
volatile uint8_t sensorValue5 = 0;
volatile uint8_t sensorValue6 = 0;
volatile uint8_t sensorValue7 = 0;

volatile int16_t errorNumerator = 0;
volatile int16_t errorDenominator = 0;

volatile int16_t lastError = 0;
volatile int16_t error = 0;

const int8_t Kp = 3;
const int8_t Kd = 4;

const uint8_t baseSpeed = 55;

volatile int16_t control = 0;

const uint32_t piviotTime = 1500000;

void updateDutyFromError (void);
void clearSensorValueArray (void);
void calculateP (void);

//******************************************************************************
// Name of Function: main
// Description: Initializes hardware and continuously polls bumper switches
// to control wheel direction and LED indicators.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
int main(void) {
    MAP_WDT_A_holdTimer();

    configure432IO();
    configureRobotIO();

    // Configure PWM for both wheels
    configPWMTimer(PERIOD, CLOCKDIVIDER, currentSpeedL, LEFTCHANNEL);
    configPWMTimer(PERIOD, CLOCKDIVIDER, currentSpeedR, RIGHTCHANNEL);

    serviceLeftMotor();
    serviceRightMotor();

    //toggleRSLKLEDTest();

    Timer_A_startCounter(TIMER, TIMER_A_UP_MODE);

    //__enable_interrupts();

    //Power up
    toggleRSLKLEDTest(); //Add toggle LED 1 and LED 2

    while(1) {
        if (currentMode == StandBy) {

            //MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);

            //P1->OUT |= BIT0;
            handleStandBy();
            updateDutyState();

            //Wheels off
            MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P3, GPIO_PIN7 | GPIO_PIN6);

            //Check BMP
            if (GPIO_getInterruptStatus(GPIO_PORT_P4, GPIO_PIN0)) {
                GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN0);
                currentMode = Tracking;
                //LED 1 on
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
                //Set motor states

                //Wheels on
                // Left wheel
                // IN1 = 1, IN2 = 0
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P5, GPIO_PIN2);
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN0);

                // set direction
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN4);

                // Enable motor
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P3, GPIO_PIN7);

                //Right wheel
                // IN1 = 1, IN2 = 0
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P5, GPIO_PIN0);
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN2);

                // set direction
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN5);

                // Enable motor
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P3, GPIO_PIN6);
            }
            //__delay_cycles(1500000);
            //P1->OUT &= ~BIT0;
        }
        else if (currentMode == Tracking) {
            handleStandBy();
            //updateDutyState();

            updateDutyFromError();

