JacobBachle/MSP432/lab10/lab10.c
//******************************************************************************
// Name of Function: processSensorData
// Description: Counts sensor values to count how many senesors indicate right
// and left activation.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void processSensorData(void) {
    leftCount = 0;
    rightCount = 0;
    clearSensorValueArray();
    if ((sensorValues & BIT0)) {
        sensorValue0 = 1;
        leftCount++;
    }
    if ((sensorValues & BIT1)) {
        sensorValue1 = 1;
        leftCount++;
    }
    if ((sensorValues & BIT2)) {
        sensorValue2 = 1;
        leftCount++;
    }
    if ((sensorValues & BIT3)) {
        sensorValue3 = 1;
        leftCount++;
    }
    if ((sensorValues & BIT4)) {
        sensorValue4 = 1;
        rightCount++;
    }
    if ((sensorValues & BIT5)) {
        sensorValue5 = 1;
        rightCount++;
    }
    if ((sensorValues & BIT6)) {
        sensorValue6 = 1;
        rightCount++;
    }
    if ((sensorValues & BIT7)) {
        sensorValue7 = 1;
        rightCount++;
    }
    calculateP();
}

void clearSensorValueArray (void) {
    sensorValue0 = 0;
    sensorValue1 = 0;
    sensorValue2 = 0;
    sensorValue3 = 0;
    sensorValue4 = 0;
    sensorValue5 = 0;
    sensorValue6 = 0;
    sensorValue7 = 0;
}

void calculateP (void) {
    //processSensorData();
    //calculate error

    errorNumerator = 0;
    errorDenominator = 0;

    errorNumerator = (sensorValue0 * IR0Weight) + (sensorValue1 * IR1Weight) + (sensorValue2 * IR2Weight)
            + (sensorValue3 * IR3Weight) + (sensorValue4 * IR4Weight) + (sensorValue5 * IR5Weight)
            + (sensorValue6 * IR6Weight) + (sensorValue7 * IR7Weight);
    errorDenominator = (sensorValue0 + sensorValue1 + sensorValue2 + sensorValue3 + sensorValue4
            + sensorValue5 + sensorValue6 + sensorValue7);

    if (errorDenominator == 0) {
        lastError = error;
        error = 0;

    }
    else {
        lastError = error;
        error = errorNumerator / errorDenominator;
    }

    clearSensorValueArray();
}

void updateDutyFromError (void) {
    control = (Kp * error) + (Kd * (error - lastError));
    // Convert control values to current speed R and current speed L
    if (leftCount == 3) {
        //do left piviot turn
        Timer_A_stopTimer(TIMER);
        configPWMTimer(PERIOD, CLOCKDIVIDER, 0, LEFTCHANNEL);
        configPWMTimer(PERIOD, CLOCKDIVIDER, slowDuty, RIGHTCHANNEL);
        Timer_A_startCounter(TIMER, TIMER_A_UP_MODE);
        //sofware delay, time it takes to piviot
        __delay_cycles(piviotTime);
    }
    else {
        currentSpeedR = baseSpeed - control;
    }


    //currentSpeedR = baseSpeed - control;
    if (rightCount == 3) {
        //Do right piviot turn
        //do left piviot turn
        Timer_A_stopTimer(TIMER);
        configPWMTimer(PERIOD, CLOCKDIVIDER, slowDuty, LEFTCHANNEL);
        configPWMTimer(PERIOD, CLOCKDIVIDER, 0, RIGHTCHANNEL);
        Timer_A_startCounter(TIMER, TIMER_A_UP_MODE);
        //sofware delay, time it takes to piviot
        __delay_cycles(piviotTime);
    }
    else {
        currentSpeedL = baseSpeed + control;
    }

    //currentSpeedL = baseSpeed + control;

    Timer_A_stopTimer(TIMER);
    configPWMTimer(PERIOD, CLOCKDIVIDER, currentSpeedR, LEFTCHANNEL);
    configPWMTimer(PERIOD, CLOCKDIVIDER, currentSpeedL, RIGHTCHANNEL);
    Timer_A_startCounter(TIMER, TIMER_A_UP_MODE);
}

//******************************************************************************
// Name of Function: LEDStatesControl
// Description: Using processed sensor data, to determine the positon the RSLK
// is on the track mapped to an LED2 state.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void LEDStatesControl(void) {
    totalCount = (leftCount + rightCount);

    if (totalCount == 0) {
        LED2State = WHITE;
        currentCorrectionNeeded = lost;
    }
    else if (leftCount == rightCount) {
        LED2State = GREEN;
        timeNotGreen = 0;
        currentCorrectionNeeded = stright;
    }
    else if ((leftCount > 0) & (rightCount == 0)) {
        LED2State = RED;
        timeNotGreen++;
        currentCorrectionNeeded = hardRight;
    }
    else if ((rightCount > 0) & (leftCount == 0)) {
        LED2State = BLUE;
        timeNotGreen++;
        currentCorrectionNeeded = hardLeft;
    }
    else if (leftCount > rightCount) {
        LED2State = YELLOW;
        timeNotGreen++;
        currentCorrectionNeeded = right;
    }
    else if (rightCount > leftCount) {
        LED2State = CYAN;
        timeNotGreen++;
        currentCorrectionNeeded = left;
    }

    /*
    // LED1 mode control
    switch(currentMode) {
        case PowerUp:
            // Toggle LED1 once
            GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
            __delay_cycles(1500000); //Delay 500 ms
            GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);

            // Toggle LED2 white once
            GPIO_toggleOutputOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
            __delay_cycles(1500000); //Delay 500 ms
            GPIO_toggleOutputOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
            break;
        case StandBy:
            if (totalCount > 0) {
                //Toggle LED1 at 1 Hz
                GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
                __delay_cycles(1500000); //Delay 500 ms
            }
            else {
                LED1State = off;
            }
            break;
        case Tracking:
            LED1State = on;
            break;
        case Lost:
            LED1State = off;
            break;
    }
    */
}

//******************************************************************************
// Name of Function: turnOnWhiteLED2
// Description: ToggleLED helper function. Turns on white led
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void turnOnWhiteLED2(void) {
    P1->OUT |= BIT0;
    GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
}

